// 医院查询
// --------------------------------------------------------------
// "医院查询-查询"按钮点击
$('#hospital-query').click(() => {
  console.log('医院查询');
  // ...
});
// "医院查询-清除"按钮点击
$('#hospital-clean').click(() => {
  console.log('医院清除');
  // ...
});
// --------------------------------------------------------------


// 毒气扩散区分析
// --------------------------------------------------------------
// "毒气扩散区分析-致死区域"按钮点击
$('#area-die').click(() => {
  resetAllArea();
  addAreaToMap(areaDie);
});
// "毒气扩散区分析-重伤区域"按钮点击
$('#area-severe').click(() => {
  resetAllArea();
  addAreaToMap(areaSevere);
});
// "毒气扩散区分析-轻伤区域"按钮点击
$('#area-minor').click(() => {
  resetAllArea();
  addAreaToMap(areaMinor);
});
// "毒气扩散区分析-吸入反应区域"按钮点击
$('#area-inhalation').click(() => {
  resetAllArea();
  addAreaToMap(areaInhalation);
});
// --------------------------------------------------------------


// 最短救援路线
// --------------------------------------------------------------
$('#result-clean').click(() => {
  console.log('清除结果');
  // ...
});

$('#retrive-route').click(() => {
  console.log('获取路线');
  // ...
});
// --------------------------------------------------------------
