// 医院查询
// --------------------------------------------------------------
// "医院查询-查询"按钮点击
$('#hospital-query').click(() => {
  console.log('医院查询');
  // ...
});
// "医院查询-清除"按钮点击
$('#hospital-clean').click(() => {
  console.log('医院清除');
  // ...
});
// --------------------------------------------------------------


// 毒气扩散区分析
// --------------------------------------------------------------
// "毒气扩散区分析-致死区域"按钮点击
$('#area-die').click(() => {
  if(areaShow.die === false){
    areaShow.die = true;

    addAreaToMap(areaDie);
  }else{
    console.log("致死区域");
  }
});
// "毒气扩散区分析-重伤区域"按钮点击
$('#area-severe').click(() => {
  if(areaShow.die === true){
    removeAreaFromMap(areaDie);
    areaShow.die = false;
  }
  // ...
});
// "毒气扩散区分析-轻伤区域"按钮点击
$('#area-minor').click(() => {
  console.log('轻伤区域');
  // ...
});
// "毒气扩散区分析-吸入反应区域"按钮点击
$('#area-inhalation').click(() => {
  console.log('吸入反应区域');
  // ...
});
// --------------------------------------------------------------


// 最短救援路线
// --------------------------------------------------------------
$('#result-clean').click(() => {
  console.log('清除结果');
  // ...
});

$('#retrive-route').click(() => {
  console.log('获取路线');
  // ...
});
// --------------------------------------------------------------
